@include("template::mycms.views._header")

<main class="main">

    <!-- Start Breadcrumb
    ============================================= -->
    <div class="site-breadcrumb" style="background: url(/mycms/cms/theme/mycms/assets/img/breadcrumb/breadcrumb.jpg)">
        <div class="container">
            <h1 class="breadcrumb-title">插件协议 & 免责声明</h1>
            <ul class="breadcrumb-menu clearfix">
                <li><a href="{{home_path()}}">网站首页</a></li>
                <li class="active">插件协议 & 免责声明</li>
            </ul>
        </div>
    </div>
    <!-- End Breadcrumb -->

    <!-- Start About
    ============================================= -->
    <div class="about-area de-padding">
        <div class="container">
            <div class="about-wpr">
                <div class="about-left style-2">
                    <h2 class="about-title">
                        插件协议
                    </h2>
                    <div class="entry-content wysiwyg py-3">
                        <p>
                            MyCms在此特别提醒您（用户）在购买使用MyCms插件之前，请认真阅读本《MyCms插件协议》（以下简称“协议”），确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。</p>
                        <p>
                            本协议约定MyCms官网与用户之间的权利义务。“用户”是指注册、登录、使用本服务的个人。本协议可由MyCms官网随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本网站查阅最新版协议条款。在MyCms官网修改协议条款后，如果用户不接受修改后的条款，请立即停止使用MyCms官网提供的服务，用户继续使用MyCms官网提供的服务将被视为接受修改后的协议。</p>
                        <h3>一、插件下载</h3>
                        <p>1、用户可以在MyCms官网或用户MyCms后台插件管理中在线下载MyCms插件</p>
                        <p>2、MyCms付费插件需要在注册登录且购买后才可以下载。</p>
                        <h3>二、插件购买</h3>
                        <p>1、用户可以在MyCms官网或用户自有后台插件管理中在线购买MyCms付费插件，购买时请提前注册好MyCms官网账号。</p>
                        <p>
                            2、用户以MyCms官网允许的支付方式购买MyCms付费插件时，用户应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若用户不具备前述主体资格，则用户及用户的监护人应承担因此而导致的一切后果，同时MyCms官网将保留追究用户及其监护人民事、刑事责任等权利，且MyCms官网有权注销(永久冻结)用户的MyCms官网帐号，并有权向用户及用户的监护人索赔。</p>
                        <p>
                            3、用户应当在购买使用MyCms付费插件之前认真阅读全部协议内容。用户确认MyCms官网对协议中所含免除或限制其责任的条款已尽提示、说明义务，用户同意此等条款，用户如对协议内容有任何异议的，应向MyCms官网咨询。但无论用户事实上是否在使用MyCms付费插件之前认真阅读了本协议内容，只要用户购买使用了MyCms付费插件，既与MyCms官网缔结了本协议，本协议即对用户产生约束，届时用户不应以未阅读本协议的内容或者未获得MyCms官网对用户问询的解答等理由，主张本协议无效或要求撤销本协议。</p>
                        <p>4、用户承诺接受并遵守本协议的约定。如果用户不同意本协议的约定，应立即停止购买使用MyCms付费插件。</p>
                        <p>
                            5、MyCms官网有权根据需要不时地制订、修改本协议或各类规则，并以公示的方式进行公告，不再单独通知用户。变更后的协议和规则一经公布后，立即自动生效。如用户不同意相关变更，应当立即停止使用MyCms付费插件。用户继续使用MyCms付费插件的，即表示用户接受经修订的协议。</p>
                        <h3>二、插件使用</h3>
                        <p>1、MyCms插件(包含免费和付费插件)禁止用于分发平台进行二次分发。</p>
                        <p>2、MyCms插件仅限自己学习使用，一切商业行业和本站无关。</p>
                        <p>3、MyCms插件禁止分享、复制、转售和传播。</p>
                        <p>4、用户不得利用MyCms插件制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容： <br> (1) 反对宪法所确定的基本原则的； <br> (2)
                            危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； <br> (3) 损害国家荣誉和利益的； <br> (4) 煽动民族仇恨、民族歧视，破坏民族团结的； <br> (5)
                            破坏国家宗教政策，宣扬邪教和封建迷信的； <br> (6) 散布谣言，扰乱社会秩序，破坏社会稳定的； <br> (7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； <br> (8)
                            侮辱或者诽谤他人，侵害他人合法权益的； <br> (9)
                            不遵守法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的； <br> (10)
                            含有法律、行政法规禁止的其他内容的信息。</p>
                        <p>
                            如果用户违反相关上述相关使用条例，MyCms官网有权利收回用户购买的付费插件和用户在MyCms官网注册的账号，如果有违反法律、法规和政策禁用的内容进行使用的，MyCms官网有权向公安机关举报并配合公安机关提供用户相关隐私个人信息。</p>
                        <h3>三、插件更新</h3>
                        <p>1、在更新MyCms插件到最新版本时，请做好当前插件版本和整站的备份，MyCms不对插件更新升级造成的损失承担任何责任。</p>
                        <p>2、插件最新版本有相应版本限制，如果更新的插件版本不适合你当前的MyCms版本，请更新你的MyCms到适用的版本。</p>
                        <p>3、如因MyCms插件被下架造成的插件无法更新，MyCms不承担任何责任。</p>
                        <p>4、如因MyCms插件作者放弃更新插件造成的无法更新，MyCms不承担任何责任。</p>
                        <h3>四、插件价格</h3>
                        <p>1、MyCms付费插件价格由插件作者进行制定。</p>
                        <p>2、MyCms付费插件作者有权力随时对插件价格进行调整，插件售出金额以最终结算价格为准，已售出的付费插件不做任何差价补偿。</p>
                        <p>3、如果因系统BUG或用户使用特殊手段以低价或免费的形式购买的插件，MyCms有权回收售出的插件。</p>
                        <h3>五、插件授权</h3>
                        <p>1、MyCms付费插件标准授权(基础授权)仅限用于个人或企业自营网站或应用，禁止用于外包或定制软件，禁止二次转售插件源码。</p>
                        <p>2、MyCms付费插件高级授权可用于个人或企业自营网站或应用或为客户定制开发，禁止二次转售插件源码。</p>
                        <p>3、MyCms付费插件标准授权有效期内可通过补差价的形式升级至高级授权，高级授权不可以降至标准授权。</p>
                        <h3>六、退款和转让</h3>
                        <p>1、MyCms付费插件因提供全部源码，购买后不提供任何原因退款，请在购买前慎重考虑和仔细阅读此协议。</p>
                        <p>2、MyCms付费插件如果因作者将插件调整为免费插件或低价插件，此前购买的插件不提供任何的补偿或退款。</p>
                        <p>3、MyCms付费插件禁止以任何形式进行转让和出售。</p>
                        <h3>七、知识产权声明</h3>
                        <p>1、MyCms插件源代码所有权归插件作者所有。</p>
                        <p>2、除另有特别声明外，MyCms插件所依托的代码、文字、图片等著作权、专利权及其他知识产权均归其作者所有。</p>
                        <h3>八、法律责任</h3>
                        <p>
                            1、如果MyCms官网发现或收到他人举报或投诉用户违反本协议约定的，MyCms官网有权不经通知随时对相关内容，包括但不限于用户资料、聊天记录进行审查、删除，并视情节轻重对违规帐号处以包括但不限于警告、帐号封禁、设备封禁、功能封禁的处罚。</p>
                        <p>
                            2、用户理解并同意，MyCms官网有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。</p>
                        <p>
                            3、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿MyCms官网与合作公司、关联公司，并使之免受损害。</p>
                        <h3>九、不可抗力及其他免责事由</h3>
                        <p>
                            1、用户理解并确认，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，MyCms官网将努力在第一时间与相关单位配合，及时进行修复，但是由此给用户或第三方造成的损失，MyCms官网及合作单位在法律允许的范围内免责。</p>
                        <p>
                            2、本服务同大多数互联网服务一样，受包括但不限于用户原因、网络服务质量、社会环境等因素的差异影响，可能受到各种安全问题的侵扰，如他人利用用户的资料，造成现实生活中的骚扰；用户下载安装的其它软件或访问的其他网站中含有“特洛伊木马”等病毒，威胁到用户的计算机信息和数据的安全，继而影响本服务的正常使用等等。用户应加强信息安全及使用者资料的保护意识，要注意加强帐号保护，以免遭致损失和骚扰。</p>
                        <p>
                            3、用户理解并确认，本服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险，因此导致的用户或第三方任何损失，MyCms官网不承担任何责任。</p>
                        <p>
                            4、用户理解并确认，在使用本服务过程中存在来自任何他人的包括误导性的、欺骗性的、威胁性的、诽谤性的、令人反感的或非法的信息，或侵犯他人权利的匿名或冒名的信息，以及伴随该等信息的行为，因此导致的用户或第三方的任何损失，MyCms官网不承担任何责任。</p>
                        <p>
                            5、用户理解并确认，MyCms官网需要定期或不定期地对MyCms官网平台或相关的设备进行检修或者维护，如因此类情况而造成服务在合理时间内的中断，MyCms官网无需为此承担任何责任，但MyCms官网应事先进行通告。</p>
                        <p>
                            6、MyCms官网依据法律法规、本协议约定获得处理违法违规或违约内容的权利，该权利不构成MyCms官网的义务或承诺，MyCms官网不能保证及时发现违法违规或违约行为或进行相应处理。</p>
                        <p>7、用户理解并确认，对于MyCms官网向用户提供的下列产品或者服务的质量缺陷及其引发的任何损失，MyCms官网无需承担任何责任： <br>(1)
                            MyCms官网向用户免费提供的服务； <br>(2) MyCms官网向用户赠送的任何产品或者服务。</p>
                        <p>
                            8、在任何情况下，MyCms官网均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因用户使用MyCms官网或本服务而遭受的利润损失，承担责任（即使MyCms官网已被告知该等损失的可能性亦然）。尽管本协议中可能含有相悖的规定，MyCms官网对用户承担的全部责任，无论因何原因或何种行为方式，始终不超过用户因使用MyCms官网提供的服务而支付给MyCms官网的费用(如有)。</p>
                        <h3>十、服务的变更、中断、终止</h3>
                        <p>
                            1、鉴于网络服务的特殊性，用户同意MyCms官网有权随时变更、中断或终止部分或全部的服务（包括收费服务）。MyCms官网变更、中断或终止的服务，MyCms官网应当在变更、中断或终止之前通知用户。</p>
                        <p>2、如发生下列任何一种情形，MyCms官网有权变更、中断或终止向用户提供的免费服务或收费服务，而无需对用户或任何第三方承担任何责任： <br> (1)
                            根据法律规定用户应提交真实信息，而用户提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明； <br> (2) 用户违反相关法律法规或本协议的约定； <br> (3)
                            按照法律规定或有权机关的要求； <br> (4) 出于安全的原因或其他必要的情形。</p>
                        <h3>十一、其他</h3>
                        <p>1、MyCms官网郑重提醒用户注意本协议中免除MyCms官网责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。</p>
                        <p>
                            2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和MyCms官网之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交MyCms官网住所地有管辖权的人民法院管辖。</p>
                        <p>3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。</p></div>
                </div>

            </div>
        </div>
    </div>
    <!-- End About -->

</main>

<div class="clearfix"></div>

@include("template::mycms.views._footer")
